# ObjsDemolished Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..ObjsDemolished Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Cannot assign [Element] to circuit. Objects that are demolished cannot be added to a circuit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ObjsDemolished { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ObjsDemolished As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ObjsDemolished {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace